[
  {
    "sellerid": "5c77b389adcc6017630e69a9",
    "type": "Nylon",
    "sub_type": "",
    "name": "pariatur",
    "description": "Irure eiusmod dolor velit culpa aute elit ullamco nulla do mollit est cillum exercitation amet. Commodo sint tempor aliqua commodo fugiat velit. Est pariatur enim aute culpa excepteur fugiat esse occaecat dolore ut Lorem ad duis.",
    "rating": 3.9614,
    "spec_data": {
      "color": "yellow",
      "minorder": 97,
      "cost": 616,
      "strechable": false,
      "washcare": "Hand Wash"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a6b",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b333adcc6017630e69a7",
    "type": "Nylon",
    "sub_type": "",
    "name": "Lorem",
    "description": "Incididunt in enim labore eiusmod deserunt id nisi aliquip sint mollit incididunt sit ex. Ullamco nostrud laborum tempor adipisicing et incididunt culpa exercitation labore quis ea reprehenderit reprehenderit pariatur. Labore consectetur magna ipsum sit id eu. Culpa nulla voluptate sunt quis tempor. Nisi reprehenderit fugiat qui cupidatat veniam Lorem exercitation. Commodo ipsum fugiat voluptate nostrud elit officia ipsum sint incididunt culpa ullamco et laboris cupidatat.",
    "rating": 3.3248,
    "spec_data": {
      "color": "Blue",
      "minorder": 90,
      "cost": 535,
      "strechable": true,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a6c",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b26cadcc6017630e69a4",
    "type": "Nylon",
    "sub_type": "",
    "name": "qui",
    "description": "Aliqua incididunt aliquip ut dolore cillum magna. Ad quis commodo commodo pariatur. Dolore anim enim occaecat anim eiusmod irure fugiat ut elit ex qui. Ut esse amet tempor excepteur mollit Lorem dolor sint excepteur anim cillum mollit. Duis proident deserunt do nostrud ad. Officia commodo do ullamco qui. Id consequat ipsum in nostrud amet cupidatat deserunt dolore commodo in mollit.",
    "rating": 1.514,
    "spec_data": {
      "color": "Blue",
      "minorder": 40,
      "cost": 747,
      "strechable": true,
      "washcare": "Machine"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a6d",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b365adcc6017630e69a8",
    "type": "Nylon",
    "sub_type": "",
    "name": "tempor",
    "description": "Dolor irure sint occaecat cillum quis irure excepteur veniam tempor deserunt consequat nulla sint non. Qui amet nostrud aliqua est amet sit tempor qui proident incididunt sint. Aliquip nisi dolor excepteur Lorem labore. Fugiat consequat excepteur ut minim adipisicing do. Adipisicing occaecat ex nulla duis est minim ullamco. Culpa velit elit eiusmod elit ea non nisi fugiat excepteur fugiat qui.",
    "rating": 2.1074,
    "spec_data": {
      "color": "yellow",
      "minorder": 90,
      "cost": 513,
      "strechable": true,
      "washcare": "Machine"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a6e",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b318adcc6017630e69a6",
    "type": "Nylon",
    "sub_type": "",
    "name": "et",
    "description": "Ea proident dolor consectetur labore voluptate. Ullamco veniam sunt consectetur aute culpa eu sit sint. Dolore occaecat dolor qui incididunt deserunt nostrud in. Aliqua commodo do enim Lorem minim ut ullamco duis pariatur duis quis deserunt. Id Lorem nostrud non officia sunt amet ea deserunt aliqua nulla reprehenderit esse.",
    "rating": 3.5749,
    "spec_data": {
      "color": "Green",
      "minorder": 32,
      "cost": 756,
      "strechable": true,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a6f",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b365adcc6017630e69a8",
    "type": "Nylon",
    "sub_type": "",
    "name": "do",
    "description": "Aute deserunt Lorem esse eiusmod. Fugiat ea ullamco esse deserunt culpa officia cillum dolore id do officia sit. Occaecat consectetur ad laborum deserunt magna fugiat.",
    "rating": 0.9302,
    "spec_data": {
      "color": "Green",
      "minorder": 21,
      "cost": 241,
      "strechable": true,
      "washcare": "Hand Wash"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a70",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b365adcc6017630e69a8",
    "type": "Nylon",
    "sub_type": "",
    "name": "et",
    "description": "Excepteur reprehenderit anim anim eiusmod. Excepteur ipsum reprehenderit ullamco voluptate in do ad. In duis ex esse eiusmod id aliqua Lorem laborum reprehenderit duis nulla cupidatat id. Anim amet pariatur officia deserunt velit ad deserunt consectetur magna exercitation dolore minim pariatur. Incididunt velit cillum laboris sit. Eiusmod dolor voluptate nisi duis cupidatat duis Lorem deserunt aliquip nisi fugiat. Fugiat proident anim voluptate esse tempor fugiat.",
    "rating": 3.4165,
    "spec_data": {
      "color": "Green",
      "minorder": 77,
      "cost": 665,
      "strechable": false,
      "washcare": "Machine"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a71",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b318adcc6017630e69a6",
    "type": "Nylon",
    "sub_type": "",
    "name": "deserunt",
    "description": "Magna minim duis minim laborum ad qui officia sit ea eiusmod esse nisi. Adipisicing eiusmod elit labore consectetur ad incididunt ut magna nulla. Nisi pariatur reprehenderit culpa deserunt nostrud voluptate anim Lorem proident.",
    "rating": 4.0737,
    "spec_data": {
      "color": "Green",
      "minorder": 77,
      "cost": 371,
      "strechable": true,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a72",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b365adcc6017630e69a8",
    "type": "Nylon",
    "sub_type": "",
    "name": "cupidatat",
    "description": "Nulla aute ad enim magna sit dolor qui qui. Dolor dolore exercitation fugiat proident eiusmod elit esse nulla id. Nisi commodo nisi reprehenderit ullamco aliquip non eu proident id. Nisi cupidatat velit aliquip pariatur ullamco sunt proident.",
    "rating": 2.5749,
    "spec_data": {
      "color": "yellow",
      "minorder": 69,
      "cost": 610,
      "strechable": true,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a73",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b26cadcc6017630e69a4",
    "type": "Nylon",
    "sub_type": "",
    "name": "id",
    "description": "Ipsum excepteur sint cupidatat ad nisi. Sit ut dolor laborum pariatur eiusmod sint magna id laboris do pariatur laboris. Qui non est consectetur incididunt voluptate Lorem fugiat aliqua excepteur aliqua non. Cillum laborum eiusmod minim do. Est incididunt commodo elit est enim eiusmod culpa excepteur. Anim consectetur pariatur velit fugiat et tempor non ad nulla tempor amet aliquip irure officia. Magna ea commodo proident incididunt in eu voluptate elit adipisicing.",
    "rating": 2.482,
    "spec_data": {
      "color": "Blue",
      "minorder": 72,
      "cost": 312,
      "strechable": true,
      "washcare": "Hand Wash"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a74",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b318adcc6017630e69a6",
    "type": "Nylon",
    "sub_type": "",
    "name": "cupidatat",
    "description": "Pariatur qui cupidatat ea velit. Et sint eu ex reprehenderit. Incididunt tempor cupidatat adipisicing do laborum officia sint non adipisicing cillum do mollit ea. Commodo ipsum irure consequat elit mollit eiusmod veniam aute. Ullamco reprehenderit cupidatat Lorem amet elit culpa laboris laboris sit anim exercitation veniam dolor excepteur. Enim ad ut enim amet. Voluptate laborum eiusmod reprehenderit occaecat commodo sint eiusmod in incididunt.",
    "rating": 3.3628,
    "spec_data": {
      "color": "Blue",
      "minorder": 32,
      "cost": 723,
      "strechable": false,
      "washcare": "Hand Wash"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a75",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b365adcc6017630e69a8",
    "type": "Nylon",
    "sub_type": "",
    "name": "exercitation",
    "description": "Tempor culpa ipsum in pariatur voluptate Lorem eu. Irure Lorem laboris consequat esse qui ad irure quis cupidatat laboris ea. Lorem enim elit aliqua ex commodo ea. Mollit mollit eu esse eiusmod laboris.",
    "rating": 2.3913,
    "spec_data": {
      "color": "yellow",
      "minorder": 43,
      "cost": 776,
      "strechable": true,
      "washcare": "Hand Wash"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a76",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b2e2adcc6017630e69a5",
    "type": "Nylon",
    "sub_type": "",
    "name": "sit",
    "description": "Incididunt excepteur aliquip fugiat ipsum aliqua ipsum non velit nulla incididunt consequat cillum. Labore ut sint magna deserunt mollit pariatur cillum consequat deserunt ipsum proident sunt pariatur officia. Quis quis esse elit in voluptate non elit id magna exercitation ex id aute. Deserunt ullamco veniam nulla minim aute duis mollit duis duis.",
    "rating": 4.2388,
    "spec_data": {
      "color": "Green",
      "minorder": 36,
      "cost": 687,
      "strechable": true,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a77",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b2e2adcc6017630e69a5",
    "type": "Nylon",
    "sub_type": "",
    "name": "cillum",
    "description": "Ipsum non esse fugiat Lorem proident duis ex nisi velit fugiat voluptate. Occaecat eu do consectetur sunt occaecat deserunt amet occaecat id nulla. Laboris aute aute consectetur ea eiusmod sint Lorem consectetur do enim id. Dolore cupidatat ad qui proident sint ipsum ut esse reprehenderit minim deserunt ut. Voluptate sit est officia quis nisi ad aute amet proident veniam sunt. Laborum ipsum non non nisi laboris adipisicing in id laboris Lorem nisi aliqua ut. Voluptate duis id aliquip anim.",
    "rating": 3.595,
    "spec_data": {
      "color": "yellow",
      "minorder": 24,
      "cost": 238,
      "strechable": false,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a78",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  },
  {
    "sellerid": "5c77b365adcc6017630e69a8",
    "type": "Nylon",
    "sub_type": "",
    "name": "sint",
    "description": "Officia incididunt velit cupidatat Lorem eiusmod reprehenderit tempor laboris nulla amet tempor et sunt. Fugiat qui ex incididunt proident ad ad velit velit laborum esse et duis commodo et. Labore proident laborum aliqua minim deserunt magna ea. Elit ut dolor dolor quis duis nisi deserunt ex adipisicing excepteur. Quis amet ea sunt ex in deserunt qui ipsum officia anim in consequat. In adipisicing mollit occaecat enim quis do esse sunt.",
    "rating": 2.7262,
    "spec_data": {
      "color": "yellow",
      "minorder": 14,
      "cost": 429,
      "strechable": true,
      "washcare": "Dry clean"
    },
    "images": [
      "nylon"
    ],
    "id": "5c77e719adcc6017630e6a79",
    "specificationId": "5c755cde1ae3f46ec848f7c5"
  }
]